fix db migration
